Citadel.create(
  [
    {
    name: '大阪城',
    address: '〒540-0002 大阪府大阪市中央区大阪城１−１',
    time: '営業時間 月~日 9:00 ~ 17:00',
    image: 'photo/top_img01.jpg',
    text: 'エレベーターが配置されているので足腰が悪い方でも見学することができる。
          堀や門の位置などは江戸時代からあまり変わっておらず、展望台から見ることで人が入ってきて場所や手薄の場所を考えることができ感慨深い。
          城内では、秀吉公のプロジェクターが見ることができ生涯を知ることができる。教科書で習ったことを立体的に見ることができるので夢中に見れるはずだ。'
    },
    {
    name: '姫路城',
    address: '〒670-0012 兵庫県姫路市本町68',
    time: '営業時間 月~日 9:00~16:00',
    image: 'photo/bg_mainimg.jpg',
    text: '全体的に白いことや修築したことで、とても美しい城であることが特徴。
          大天守を中心に、櫓・門・土塀等の建造物や石垣・堀などの土木建造物が良好的に保存されている。
          たくさんの門や塀は敵を迎え撃つために設けられており、観光の際にはそのことも考えて歩くとより楽しむことができる。',
    },
    {
    name: '名古屋城',
    address: '〒460-0031 愛知県名古屋中区本丸1-1',
    time: '営業時間 月~日 9:00~16:30',
    image: 'photo/b0ff88c092c743ddbce52a13beb3456b.jpg',
    text: '名古屋城には、金の鯱が有名。名古屋城天守が完成したときからあるもので、当時の金鯱は一対で慶長大判1940枚分もの金が使用されたと言われている。現在は復元されたもの。
            建物の中に入るとヒノキの上品な香りで包まれ、入り口を入ってすぐの玄関は、18畳の一之間と28畳の二之間が並び、スケールの大きさに圧巻の一言につきます。外観、内部とも桧の白木が美しく、気品漂う当時の生活の豊かさを感じさせます。',
    },
    {
    name: '彦根城',
    address: '〒522-0061 滋賀県彦根市金亀町1-1',
    time: '営業時間 月~日 8:30~17:00',
    image: 'photo/fUEGpvh8mqy2CtU8SriTe806KrjuKLEc6heOX3iO86OIqiCliCXcrXFVvZ6DsI5K.jpeg',
    text: '廃城令により全国の城が取り壊されていく中、大隈重信が視察に来た際にその消失を惜しみ、明治天皇に上奏し取り壊しを免れたと言われる。
          国宝に指定された三重三階の天守です。牛蒡積みと呼ばれる石垣の上に築かれた天守には3種の破風様式が取り入れられ、二重目以上の窓には曲線の美しい華頭窓が使われています。その外観は実に壮麗です。また、天守の内部には鉄砲狭間や矢狭間が数多く備えられており、美しいだけでなく実戦的な構造となっています。天守の内部は見学することができます。',
    },
    {
    name: '伊予松山城',
    address: '愛媛県松山市丸之内',
    time: '営業時間 月~日 9:00~16:30',
    image: 'photo/d0235363_515284.jpg',
    text: '安政元（1602）年に再建落成した天守は、三重三階地下一階の層塔型天守という様式で、江戸時代最後の完全な城郭建築です。天守と小天守、隅櫓を渡櫓で結ぶ天守建造物群は、代表的な連立式天守を備えた城郭といわれています。現存十二天守のなかで唯一、親藩・松平家によって建築されており、そのことを物語る「葵の御紋」が瓦などに見られます。また、防備のために構えられた櫓のなかで特に注目すべきは、本丸の北に位置する野原櫓。野原櫓は日本で唯一現存する望楼型二重櫓で、天守の原型といわれており、重要文化財に指定されています。',
    },
    {
    name: '岐阜城',
    address: '〒岐阜県岐阜市金華山天守閣18',
    time: '営業時間 月~日 9:30~16:30',
    image: 'photo/350098ed41e135b798d0c538ce84e40d.jpg',
    text: '岐阜城は、標高329ｍの金華山（稲葉山）山頂に築かれた山城です。金華山はかつて⌈一石山（いっせきざん）⌋と呼ばれたように一つの岩塊で成り立っており、山裾には清流長良川が流れています。天然の要害に囲まれた岐阜城は難攻不落の城と言われていました。天守閣から見る景色は絶景で昼夜問わず楽しむことができます。
          伝一ノ門跡や伝二ノ門・下台所跡、本丸井戸などが残されています。また、山頂駅付近には金華山リス村があり、直にリスと触れ合うこともできます。',
    },
    {
    name: '竹田城跡',
    address: '〒669-5252 兵庫県朝来市和田山町竹田169',
    time: '営業時間 月~日 ',
    image: 'photo/41.jpg',
    text: '竹田城跡は、山城遺跡として全国でもまれな完存する遺構であり、虎が臥せているように見えることから「虎臥城（とらふすじょう・こがじょう）」とも呼ばれています。晩秋のよく晴れた早朝に朝霧が発生することがあり、但馬地方の風物詩となっています。この雲海に包まれた姿は、まさに天空に浮かぶ城を思わせ、いつの間にか「天空の城」・「日本のマチュピチュ」とも呼ばれるようになりました。この幻想的な風景を一目見ようとたくさんの人々が訪れます。',
    },
    {
    name: '松本城',
    address: '〒390-0873 長野県松本市丸の内4-1',
    time: '営業時間 月~日 8:30~17:00',
    image: 'photo/9ec56a7638eb0f180a7d2366cc1b9696.jpg',
    text: '石川父子によって戦国時代末期に築かれた天守は、戦いを意識した堅固な造りとなっています。大天守のほか乾小天守と渡櫓に石落しが合計11ヶ所設けられ、壁には100を超える狭間（矢狭間・鉄砲狭間）が見られます。
          天守の最上階では外の素晴らしい眺めに目がいきますが、屋根裏も見ておきたいポイントです。松本城大・小天守の最上階には天井が吊られていないため、入母屋内を見ることができます。中央には、城の守り神である二十四夜神が祀られています。',
    },
    {
    name: '熊本城',
    address: '〒860-0002 熊本県熊本市中央区本丸1-1',
    time: '営業時間 月~日 ',
    image: 'photo/2ca844ad9a0a81fe2291b4529dcba8a7.jpg',
    text: '場内の櫓の数は49カ所にも上ります。ここにも清正が作った籠城に対する徹底さが垣間見えますね。櫓は籠城の時には防戦の拠点ともなる建築物。本城の堅牢さを知る、最大の特長の一つが石垣です。熊本城の石垣は特殊な構造をしており、下の方は緩やかで、上に登るにしたがって垂直になる構造をしています。この構造は「武者返し」と言われる石垣で、這い上がることがきわめて困難なものとなっています。',
    },
    {
    name: '犬山城',
    address: '〒484-0082 愛知県犬山市犬山北古券65-2',
    time: '営業時間 月~日 9:00~16:30',
    image: 'photo/o1080060714393101076.jpg',
    text: 'まず注目したいのが、唐破風です。これは弓なりにカーブを描いている屋根の部分で、南面（正面）と北面につけられています。天守を見上げると、まず最初に目に飛び込んでくる印象的な破風で、犬山城天守の表情を決めているといっても過言ではありません。
           次に華頭窓です。天守最上部にある釣り鐘のような形の窓で、炎を思わせる曲線から「火灯窓」とも書かれます。格式が高く、神社仏閣に使われる様式です。',
    },
    {
    name: '二条城',
    address: '〒604-8301 京都府京都市中京区二条通堀川西入二条城町541',
    time: '営業時間 月~日 8:45~16:00',
    image: 'photo/img_snow_l_01.png',
    text: '今日の二条城の原型が整ったのは、三代将軍家光が後水尾天皇を二条城へ招くために数年がかりで行った大改築によるもの。創建は家康ですが、完成させたのは家光といえます。国宝・二の丸御殿の正門にあたる唐門は重要文化財であり、これもまた後水尾天皇行幸の際に設置されました。唐門は切妻造の四脚門で、堂々たる唐破風や極彩色の彫刻が特徴。同時代の唐門の中では国内最大級といわれています。',
    },
    {
    name: '上田城',
    address: '〒386-0026 長野県上田市二の丸',
    time: '営業時間 月~日 ',
    image: 'photo/500.jpeg',
    text: '上田城跡公園では春（4月上旬～下旬）には上田城千本桜まつりが、秋（11月上旬）には上田城けやき並木紅葉まつりが催され多くの人でにぎわいます。また、毎年4月下旬には上田真田まつりが行われ、真田鉄砲隊による演武や真田武者行列などで市内が盛り上がります。上田城には天守はありませんが、櫓門が1基（東虎口櫓門）、隅櫓が3基（北櫓、南櫓、西櫓）残されています。このうち、東虎口櫓門の両脇に建つ北櫓と南櫓は入館料を払って内部を見ることができます。',
    },
    {
    name: '弘前城',
    address: '〒036-8551 青森県弘前市下白銀町1',
    time: '営業時間 月~日 ',
    image: 'photo/topheader.jpg',
    text: '現存している本丸の天守は『御三階櫓（ごさんがいやぐら）』は元々はロシアから来る船の監視や万が一の襲来に対応する目的で作られた物であり幕府への配慮から御三階櫓と呼ばれていましたが、弘前城の事実的な天守閣（軍事拠点）として機能していました。
          日本三大桜名所と日本三大夜桜のダブル指定は日本唯一で、一生に一度は見ておきたい桜祭りです。',
    },
    {
    name: '丸岡城',
    address: '〒福井県坂井市丸岡町霞町1-59',
    time: '営業時間 月~日 8:30~17:00',
    image: 'photo/HU011201.jpg',
    text: '望楼は、ふもとから約35ｍの高さ。天気が良ければ四方の窓が開け放たれ、当時の城主が眺めたものと同様の丸岡の町並み、坂井平野の田園風景、かつて豊原寺があった山並みを、さえぎるものなく見渡せます。
          江戸時代につくられた城は、城主の権威を示すため、大きく立派で多層式のものが目立ちますが、丸岡城内は戦国時代の雰囲気。豪華さや優美さより、いたる所にある敵に対する備えの方が目を引きます。',
   },
   {
    name: '松江城',
    address: '〒690-0887 島根県松江市殿町1-5',
    time: '営業時間 月~日 8:30~18:30',
    image: 'photo/15571505262927e-cYu9lEQoShewwZuVYuQXw_thumb_1713.jpg',
    text: '松江城の見どころは、黒くてクールでかっこいい四重五階の現存天守。また、松江城は2015年7月に「国宝」に指定されたばかりの話題のスポットでもあります！ 城郭としては、じつに63年ぶり5城目となる指定となりました。
          松江城の天守は付櫓が接続する複合式天守のため、天守に入る前に付櫓を通過します。ここでの見逃し禁止ポイントは、壁に空いた穴。この穴は「狭間」といって、鉄砲を撃つための小窓です。',
   },
   {
    name: '備中松山城',
    address: '〒716-0004 岡山県高梁市内山下1',
    time: '営業時間 月~日 9:00~17:30',
    image: 'photo/DSC_5411-1280x720.jpg',
    text: '天守が残る日本で唯一の山城で、江戸時代から残る現存天守12城のひとつ備中松山城。山城の周辺は、高さ10ｍ以上の巨大な岩壁がそびえ、”難攻不落の名城”の面影が残っています。最近は“雲海に浮かぶ天空の山城”として全国的に人気の撮影スポットとなっており、早朝から多くのファンが訪れています。幻想的な山城の風景を撮影するなら雲海展望台へ。',
   },
   {
    name: '丸亀城',
    address: '〒763-0025 香川県丸亀市一番丁',
    time: '営業時間 月~日 9:00~16:00',
    image: 'photo/img_ogp.jpg',
    text: '丸亀城の見どころはたくさんあり、大手一の門や国宝に指定されている天守の他にも、「石垣の名城」と言われているだけあり、石垣も外すことができません。江戸時代初期の城郭石垣の最高技術を駆使して作られており、高く美しい曲線などを見られます。また、敷地内には、丸亀市立資料館もあり、歴史資料や民俗資料などさまざまな資料を見られます。',
   },
   {
    name: '宇和島城',
    address: '〒798-0060 愛媛県宇和島市丸之内1',
    time: '営業時間 月~日 6:00~17:00',
    image: 'photo/500.jpeg',
    text: '現在は、天守のほかに上立門や城塁、石垣が残っています。平成28年(2016年)3月に、藩の建造物を作ったり修繕、管理する作事所跡などが国の史跡「宇和島城跡」に追加指定されました。
          宇和島城は、島がつくことから、平安時代の築城当時は島の城だった可能性もあります。今でも海に近い距離に宇和島城はあります。宇和島城の優れた特徴として、地上からは四角い堀で囲まれたように見られますが、実際には海に突き出た部分が三角形の二辺のようになっていて、宇和島城全体が五角形になっていることです。',
   },
   {
    name: '高知城',
    address: '〒780-0850 高知県高知市丸の内1-2-1',
    time: '営業時間 月~日 9:00~17:00',
    image: 'photo/180212-081735-IMG_1048_R.jpg',
    text: '県立高知城歴史博物館は、国宝や重要文化財を含む6万7千点に及ぶ土佐藩山内家伝来の貴重な資料を中心に、高知の歴史について学ぶことができる博物館。膨大な資料と高知の歴史に特化したこの博物館は高知の観光スポットとして脚光を浴びています。本丸御殿と天守は両方とも重要文化財で、江戸時代に建造されたものです。本丸御殿内は「書院造」という武家の格式を感じることができる様式を持ち、美しい「うちわけ波」の欄間や、実戦を見据えた
          「武者隠し」の構造など、現代では国内で2件しか残らない貴重な本丸御殿の姿を知ることができます。',
   },
   {
     name: '白石城',
     address: '〒989-0251 宮城県白石市益岡町1-16',
     time: '営業時間 月~日 ',
     image: 'photo/04BDFE42177D4D7CB3668EBAE1B4D88C_LL.jpg',
     text: '天守閣は、城郭として機能した文政6年の構造による三階櫓を忠実に復元され、数百年の歳月にも耐え得る全国的にも数少ない木造復元による構造です。天守閣の高さは石垣天端から約16.7mで、戦後の木造復元天守閣では高さ・広さとも日本最大級を誇ります
            外壁から大手門にかけては、加工した石と石の間に間詰め石をいれる『打ち込みハギ技法』で石垣積みがされ、特に野づら積みを採用したのは全国でも白石城が初めてです。',
   },
   {
     name: '白河小峰城',
     address: '〒961-0074 福島県白河市郭内',
     time: '営業時間 月~日 ',
     image: 'photo/c1cd16cd.jpg',
     text: '白河小峰城の見どころは、その美しい姿ではないでしょうか。特に幾重にも重なりあう黒い屋根の姿は、心を奪われる様に凛々しく映ります。天守の高さは14メートル、三層三階の櫓で構成されています。東北地方ではあまり見かけない、総石垣造りのお城で見応えがあります。',
   },
   {
     name: '掛川城',
     address: '〒436-0079 静岡県掛川市掛川1138-24',
     time: '営業時間 月~日 9:00~17:00',
     image: 'photo/c7c2d8e1.jpg',
     text: '春には満開の桜と上品な城のコントラストの妙を見ることができます。また夜になると、ライトアップされた幻想的な城の姿を私たちに見せてくれます。山内一豊によって造られた天守には山内家伝来の歴史ある軍配や鎧などが展示されている他、石落としなど、外敵から守るための工夫が凝らされています。
            掛川城の一帯は、現在掛川城公園となっています。公園内の城内には、国の重要文化財に指定されている二ノ丸御殿や天守の他、太鼓櫓や四足門、三日月堀など、歴史と見どころに溢れています。',
   },
   {
     name: '松前城',
     address: '〒049-1511 北海道松前郡松前町松前町松城',
     time: '営業時間 月~日 9:00~17:00',
     image: 'photo/77_main_image.jpeg',
     text: '松前の桜のなかでも特に有名なものがいくつかあり、龍雲院の「蝦夷霞桜」、光善寺の「血脈桜」、天神坂門の「夫婦桜」は“三大名木”といわれ親しまれている。松前の桜は、松前藩の時代、本州からわたってきた人々が、遠く離れた江戸や京都を懐かしんで植えたのがきっかけと言われている。桜は長い間、まちの人たちによって大切に現代まで守り育てられてきた。',
   },
   {
     name: '会津若松城',
     address: '〒965-0873 福島県会津若松市追手町1-1',
     time: '営業時間 月~日 8:30~17:00',
     image: 'photo/1.jpeg',
     text: '幕末の戊辰戦争では新政府軍の猛攻に耐え難攻不落の名城と称えられましたが明治7年、政府の命令により取り壊され、現在の天守は昭和40年（1965）に再建されました。内部は博物館になっています。五層からは会津若松市街地や会津盆地、磐梯山が一望できます。',
   },
   {
     name: '広島城',
     address: '〒730-0011 広島県広島市中区基町21-1',
     time: '営業時間 月~日 9:00~17:00',
     image: 'photo/054cbbf5.jpg',
     text: '天守閣内部は歴史博物館になっていて、広島の発展や武家文化を伝える内容が充実し、見応え十分。望楼となっている最上階は広島の町が一望でき、ムシ暑い真夏の広島でも、風の涼しさを感じることができます。
            最大88もあったとされる広島城の櫓。全国でも屈指の数です。その全ては現存せず、往時を偲ぶ縁（よすが）となるのが、お堀の外周から眺めることのできる、古してなお壮麗に佇む石垣です。',
   },
   {
     name: '岡山城',
     address: '〒700-0823 岡山県岡山市丸の内2-3-1',
     time: '営業時間 月~日 9:00~17:30',
     image: 'photo/xlarge_628e5742-d682-4e4c-8c48-3f1e58de2da5.jpeg',
     text: '日本三大名園の一つである岡山市の「後楽園」は岡山城から徒歩400ｍの近さですので、両方をいっしょに楽しむのが人気です。「後楽園」は元々、藩主池田綱政が家臣の池田永忠に築造させた回遊式庭園ですが、「後楽園」という名称は明治4年から使用されています。岡山観光には絶対に外せないスポットです。のんびり回るのがおすすめです。',
   },
   {
     name: '小田原城',
     address: '〒250-0014 神奈川県小田原市城内6-1',
     time: '営業時間 月~日 9:00~17:00',
     image: 'photo/6-hdrimg-0.jpg',
     text: '江戸時代に造られた雛型や当時の建築の際に用いられた設計図を基に復元され、内部は歴史資料の展示施設となっています。常盤木門は小田原城本丸の二つの城門のうち正門にあたる非常に重要な防御拠点でした。そのためその構造は他の門よりも大きく堅固に作られていました。常盤木とは常緑広葉樹林の意味で、松の木が青々しい葉をつけて何十年も生長することから、小田原城の永久的な繁栄を願って名付けられたと言われています。',
   },
   {
     name: '福山城',
     address: '〒720-0061 広島県福山市丸之内一丁目8',
     time: '営業時間 月~日 9:00~17:00',
     image: 'photo/src_11059107.jpg',
     text: 'ほとんどの建物は空襲で焼失してしまいましたが、伏見櫓は奇跡的に残り、国の重要文化財に指定されています。重厚感のある造りは、望楼型と呼ばれる古風な建築遺構です。
            伏見櫓と同じく、現存で国の重要文化財に指定されている筋金（すじがね）御門。伏見櫓と繋がっており、内枡形を形成しています。枡形とは、周囲を囲まれ侵入してくる敵兵を一網打尽に撃破するトラップ。城内からの攻撃を想像することで何倍も楽しくなります。',
   }
  ]
)
