Citadel.create(
  [
    {
    name: '大阪城',

    },
    {
    name: '姫路城',
    },
    {
    name: '名古屋城',
    },
    {
    name: '彦根城',
    },
    {
    name: '伊予松山城',
    },
    {
    name: '岐阜城',
    },
    {
    name: '竹田城跡',
    },
    {
    name: '松本城',
    },
    {
    name: '熊本城',
    },
    {
    name: '犬山城',
    },
    {
    name: '二条城',
    },
    {
    name: '上田城',
    },
    {
    name: '弘前城',
    },
    {
    name: '丸岡城',
   },
   {
    name: '松江城',
   },
   {
    name: '備中松山城',
   },
   {
    name: '丸亀城',
   },
   {
    name: '宇和島城',
   },
   {
    name: '高知城',
   },
   {
     name: '白石城',
   },
   {
     name: '白河小峰城',
   },
   {
     name: '掛川城',
   },
   {
     name: '松前城',
   },
   {
     name: '会津若松城',
   },
   {
     name: '広島城',
   },
   {
     name: '岡山城',
   },
   {
     name: '小田原城',
   },
   {
     name: '福山城',
   }
  ]
)
