Citadel.create(
  [
    {
    name: '大阪城',
    address: '〒540-0002 大阪府大阪市中央区大阪城１−１',
    },
    {
    name: '姫路城',
    address: '〒670-0012 兵庫県姫路市本町68',
    },
    {
    name: '名古屋城',
    address: '〒460-0031 愛知県名古屋中区本丸1-1',
    },
    {
    name: '彦根城',
    address: '〒522-0061 滋賀県彦根市金亀町1-1',
    },
    {
    name: '伊予松山城',
    address: '愛媛県松山市丸之内',

    },
    {
    name: '岐阜城',
    address: '〒岐阜県岐阜市金華山天守閣18',
    },
    {
    name: '竹田城跡',
    address: '〒669-5252 兵庫県朝来市和田山町竹田169',
    },
    {
    name: '松本城',
    address: '〒390-0873 長野県松本市丸の内4-1',
    },
    {
    name: '熊本城',
    address: '〒860-0002 熊本県熊本市中央区本丸1-1',
    },
    {
    name: '犬山城',
    address: '〒484-0082 愛知県犬山市犬山北古券65-2',
    },
    {
    name: '二条城',
    address: '〒604-8301 京都府京都市中京区二条通堀川西入二条城町541',
    },
    {
    name: '上田城',
    address: '〒386-0026 長野県上田市二の丸',
    },
    {
    name: '弘前城',
    address: '〒036-8551 青森県弘前市下白銀町1',
    },
    {
    name: '丸岡城',
    address: '〒福井県坂井市丸岡町霞町1-59',
   },
   {
    name: '松江城',
    address: '〒690-0887 島根県松江市殿町1-5',
   },
   {
    name: '備中松山城',
    address: '〒716-0004 岡山県高梁市内山下1',
   },
   {
    name: '丸亀城',
    address: '〒763-0025 香川県丸亀市一番丁',
   },
   {
    name: '宇和島城',
    address: '〒798-0060 愛媛県宇和島市丸之内1',
   },
   {
    name: '高知城',
    address: '〒780-0850 高知県高知市丸の内1-2-1',
   },
   {
     name: '白石城',
     address: '〒989-0251 宮城県白石市益岡町1-16',
   },
   {
     name: '白河小峰城',
     address: '〒961-0074 福島県白河市郭内',
   },
   {
     name: '掛川城',
     address: '〒436-0079 静岡県掛川市掛川1138-24',
   },
   {
     name: '松前城',
     address: '〒049-1511 北海道松前郡松前町松前町松城',
   },
   {
     name: '会津若松城',
     address: '〒965-0873 福島県会津若松市追手町1-1',
   },
   {
     name: '広島城',
     address: '〒730-0011 広島県広島市中区基町21-1',
   },
   {
     name: '岡山城',
     address: '〒700-0823 岡山県岡山市丸の内2-3-1',
   },
   {
     name: '小田原城',
     address: '〒250-0014 神奈川県小田原市城内6-1',
   },
   {
     name: '福山城',
     address: '〒720-0061 広島県福山市丸之内一丁目8',
   }
  ]
)
